Identification Division.
Program-id. MAIN.
Procedure Division.
DISPLAY "MAIN".
Identification Division.
Program-id. NESTED1.
Procedure Division.
DISPLAY "NESTED1".
End program NESTED1.
End program MAIN.
Identification Division.
Program-id. MAIN2.
Procedure Division.
DISPLAY "MAIN2".
End program MAIN2.