IDENTIFICATION DIVISION.
PROGRAM-ID. EVAL.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUM1 PIC 9(9).
PROCEDURE DIVISION.
PERFORM UNTIL EXIT
GO TO PAR1
END-PERFORM.
PAR1.
STOP RUN.