IDENTIFICATION DIVISION.
PROGRAM-ID.    CBACT01C.
PROCEDURE DIVISION.
EXEC SQL  WHENEVER SQLERROR GOTO HANDLER  END-EXEC.
EXEC SQL  WHENEVER SQLWARNING GO TO HANDLER  END-EXEC.
EXEC SQL  WHENEVER SQLERROR CONTINUE  END-EXEC.
EXEC SQL  WHENEVER NOT FOUND GO TO HANDLER END-EXEC.
EXEC SQL
SELECT ABC FROM XYZ;
END-EXEC.
EXEC SQL  WHENEVER SQLERROR GOTO : HANDLER  END-EXEC.
EXEC SQL  WHENEVER SQLERROR GO TO : HANDLER  END-EXEC.
HANDLER.
DISPLAY "HANDLER".