IDENTIFICATION DIVISION.
PROGRAM-ID.    CBACT01C.
PROCEDURE DIVISION.
DECLARATIVES.
INPUT-PROBLEM SECTION.
USE AFTER STANDARD EXCEPTION PROCEDURE ON INPUT.
DISPLAY "EXCEPTION".
END DECLARATIVES.