IDENTIFICATION DIVISION.
PROGRAM-ID. EVAL.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUM1 PIC 9(9).
PROCEDURE DIVISION.
PERFORM DISPLAY "Hello World"
END-PERFORM.
PAR1.
STOP RUN.