IDENTIFICATION DIVISION.
PROGRAM-ID. HLLOWRLD.
PROCEDURE DIVISION.
PERFORM A THRU C.
STOP RUN.
A.
B.
PERFORM X.
C.
X.
IF (SQLCODE IS LESS THAN 0)
DISPLAY 'SQLCODE'
ELSE
STOP RUN.