IDENTIFICATION DIVISION.
PROGRAM-ID.  CASE4.
PROCEDURE DIVISION.
DISPLAY 'OUT'.
GO TO PARAG1.
PARAG1.
DISPLAY 'PARAG1'.
PERFORM PARAG2.
PARAG2.
DISPLAY 'PARAG2'.