IDENTIFICATION DIVISION.
PROGRAM-ID. TESTREPL.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  PARENT PIC 9.
01  CHILD1 PIC 9.
PROCEDURE DIVISION.
MAINLINE.
MOVE 0 TO   CHILD1   OF   PARENT.
MOVE 0 TO   CHILD2   OF    PARENT.
GOBACK.