IDENTIFICATION DIVISION.
PROGRAM-ID.    CBACT01C.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 PRG.
05 WK1 PIC X.
PROCEDURE DIVISION.
EXEC CICS HANDLE ABEND PROGRAM(PRG)
END-EXEC.