IDENTIFICATION DIVISION.
PROGRAM-ID. CONDS2.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUM1 PIC 9(9).
01 WS-NUM2 PIC 9(9).
PROCEDURE DIVISION.
A000-PARA.
IF NOT WS-NUM1 > WS-NUM2
DISPLAY 'HELLO'
IF WS-NUM1 > WS-NUM2
GO TO A000-PARA
END-IF
END-IF
PERFORM A000-PARA.
STOP RUN.