IDENTIFICATION DIVISION.
PROGRAM-ID.    CBACT01C.
PROCEDURE DIVISION.
DECLARATIVES.
INPUT-PROBLEM SECTION.
Use For Debugging On Some-Routine.
DISPLAY "EXCEPTION".
END DECLARATIVES.
Some-Routine.
DISPLAY "SOME-ROUTINE".