IDENTIFICATION DIVISION.
PROGRAM-ID.  SECTST.
PROCEDURE DIVISION.
DISPLAY 'OUT'.
GO TO PARAG1.
SECT1 SECTION.
PARAG1.
DISPLAY 'PARAG1'.
PERFORM PARAG2 OF SECT2.
SECT2 SECTION.
PARAG2.
DISPLAY 'PARAG2'.