IDENTIFICATION DIVISION.
PROGRAM-ID. CONDS1.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUM1 PIC 9(9).
01 WS-NUM2 PIC 9(9).
PROCEDURE DIVISION.
A000-PARA.
IF NOT WS-NUM1 > WS-NUM2
DISPLAY 'HELLO'
GO TO A000-PARA.
STOP RUN.