IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NODEJS-CODE PIC X(100) value "console.log('Hello World!')".
PROCEDURE DIVISION.
CALL 'EXEC_NODEJS' USING NODEJS-CODE
DISPLAY "Starting an HTTP server on port 8000".
CALL 'EXEC_NODEJS_FILE' USING "example/grace-hopper.js"
DISPLAY "Starting an HTTP server on port 8000".
CALL 'EXEC_NODEJS_FILE' USING "example/server.js".
STOP RUN.